#include<iostream>
#include"string.h"
#include <stdio.h>
using namespace std;
int main(void)
{
    
    const char* string_lst[] = {
          "  180.90       88уш    ",
          "   10.25       65уш    ",
          "   56.14        90уш   ",
          "  104.65        90уш   ",
          "  100.30       88уш    ",
          "  297.15        50╪ш   ",
          "   26.75       65уш    ",
          "  130.62        50╪ш   ",
          "  240.28       58уш    ",
          "  270.62        80уш   ",
          "  115.87       88уш    ",
          "  247.34       95уш    ",
          "   73.21        90уш   ",
          "  101.00        50╪ш   ",
          "   79.54        50╪ш   ",
          "  278.44        70уш   ",
          "  199.26        50╪ш   ",
          "   12.97        90уш   ",
          "  166.30       78уш    ",
          "  125.50       58уш    ",
          "   84.98        90уш   ",
          "  113.35       68уш    ",
          "  166.57        50╪ш   ",
          "   42.56        90уш   ",
          "   81.90       95уш    ",
          "  131.78        80уш   ",
          "  255.89       78уш    ",
          "  109.17        90уш   ",
          "  146.69       68уш    ",
          "  139.33       65уш    ",
          "  141.16       78уш    ",
          "  154.74        80уш   ",
          "   59.42        80уш   ",
          "   85.44       68уш    ",
          "  293.70       88уш    ",
          "  261.79       65уш    ",
          "   11.30       88уш    ",
          "  268.27       58уш    ",
          "  128.29       88уш    ",
          "  251.03        80уш   ",
          "  208.39       75уш    ",
          "  128.88       75уш    ",
          "   62.06        90уш   ",
          "  225.87       75уш    ",
          "   12.89       75уш    ",
          "   34.28       75уш    ",
          "   62.16       58уш    ",
          "  129.12        50╪ш   ",
          "  218.37        50╪ш   ",
          "  289.69        80уш   "
    };
    double i_price, i_zhe;
    double sum=0,ori_sum= 0;
    for (int i = 0; i < 50; i++)
    {
        sscanf_s(string_lst[i]," %lf %lf",&i_price,&i_zhe);
        //cout << "т╜╪ш:" << i_price << " ╢Рушё╨" << i_zhe << " ож╪шё╨" << i_price * (i_zhe / 100) << endl;
        printf("т╜╪шё╨%6f, ╢Р%.0fуш, ож╪шё╨%6f\n",i_price,i_zhe,i_price*i_zhe/100);
        ori_sum += i_price;
        sum += i_price * (i_zhe / 100);
    }
    cout << sum <<endl;
    cout << ori_sum << endl;
	return 0;
}